config.org
#+TITLE: My Literate Emacs Configuration
#+STARTUP: overview
#+EXPORT_FILE_NAME: index.html
#+PROPERTIES: header-args :lexical t

* Preliminaries

** Preface

I was first introduced to Emacs by a friend at my college. I had been resistant to a lot of things in my life, like the
4-finger claw for playing mobile games, 10-finger touch typing on laptops, learning vim keybindings, and this time,
Emacs. I can only count how many times these things have saved me from a time-bubble burst. These seemingly obscure and
optional(-looking) things have indeed proven to be a few of the most influential aspects of my life.

[[https://www.csee.umbc.edu/resources/computer-science-help-center/resources-for-new-students/an-introduction-to-emacs][Emacs]] holds a special place at the nucleus of my technological toolkit. All my workflows simplify down, because of its
indcredible ingrained & integrable plugin ecosystem. You can't imagine any other software working so well for a variety
of use cases, sometimes even better than their recommended options. It has elevated my workflow as a programmer to a
whole new level.

** Introduction

This file, even though looking like a documentation or a book is indeed my emacs configuration!
(And also my ever updating notes while I'm learning emacs).

This is possible because of the org-babel plugin (inbuilt in Emacs as of now) that allows Emacs to contain code-blocks
within the org-mode documents. And this style of writing code within natural language is known as Literate Programming.

You can view my configuration at:
- [[https://animeshz.github.io/.emacs.d/][Website]]
- [[https://github.com/Animeshz/.emacs.d][GitHub]]

* Getting Started

** Installation

Install as you wish, I prefer using nix + home-manager for installation.

#+BEGIN_SRC nix :tangle no
{ pkgs }:
{
  programs.emacs = {
    enable = true;
    package = pkgs.emacs29;

    extraPackages = epkgs: with epkgs; with pkgs; [
      custom.emacs-pcre
      custom.emacs-chdir
    ];
  };
}
#+END_SRC

I export emacs-pcre and emacs-chdir as custom packages on my [[https://github.com/Animeshz/linux-desktop][nix config]].

** Basic Keybinds

I like to remember a few keybinds so in-case my config had any error, I could still use emacs with these fallback
keybinds. And these keybinds are in general good enough for my hands as well hence I mostly don't change them.

- C = Ctrl
- M = Alt
- S = Shift

| Scope      | Keybind                | Action                                                      |
|------------+------------------------+-------------------------------------------------------------|
| global     | M-x                    | View Available Commands                                     |
|            | C-x C-f                | Find File                                                   |
|            | C-h [f / v / k]        | Help on [functions / variables / key-chords]                |
|            | C-x [2 / 3 / 0 / 1]    | Window Split [Down / Right / Close / Close All Except This] |
|            | C-x o / C-w C-w (Evil) | Switch Window Split                                         |
| org-mode   | C-c C-c                | Run CodeBlock or Format Table                               |
|            | C-c C-l                | Insert Link                                                 |
|            | C-c C-,                | Insert Snippets                                             |
| minibuffer | C-y                    | Paste                                                       |

=M-<number>= is a shorthand for =C-u <number>=, and is used to pass first argument =number= in interactive commands
via M-x or keybind.

** Tutorials

I like to recommend [[https://www.youtube.com/watch?v=B6jfrrwR10k][this video]] if you want to get familiarized with emacs! This packs a lot of information with
effective presentations instead of most videos which talk way too much and delivers barely anything useful.

[[https://www.youtube.com/playlist?list=PLlHHtPGox8K6bcuruX10Evf4AYGzYQKiz][This playlist]] is good for getting quick short videos for further learning emacs on your own pace.

* Emacs Configuration

** Early-Init and Init

The [[./early-init.el][early-init.el]] and [[./init.el][init.el]] files are the first two files emacs read when starting up.

I kept them separated from this main configuration because the former do very naive stuffs
(such as basic ui changes and performance optimization), and the latter contains bootstrap code for Elpaca the package
manager which is a prerequisite for most of this config and also it loads this config in the end.

