index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-22 Thu 17:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Literate Emacs Configuration</title>
<meta name="author" content="Animesh Sahu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<div id="toggle-theme">dark theme</div><div id="toggle-toc">&#9776;</div>
</div>
<div id="content" class="content">
<h1 class="title">My Literate Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000006">1. Preliminaries</a>
<ul>
<li><a href="#org0000000">1.1. Preface</a></li>
<li><a href="#org0000003">1.2. Introduction</a></li>
</ul>
</li>
<li><a href="#org0000012">2. Getting Started</a>
<ul>
<li><a href="#org0000009">2.1. Installation</a></li>
<li><a href="#org000000c">2.2. Basic Keybinds</a></li>
<li><a href="#org000000f">2.3. Tutorials</a></li>
</ul>
</li>
<li><a href="#org0000030">3. Emacs Configuration</a>
<ul>
<li><a href="#org0000015">3.1. Early-Init and Init</a></li>
<li><a href="#org0000018">3.2. Better Defaults (Almost Mandatory)</a></li>
<li><a href="#org000001b">3.3. Better Org-Mode Defaults</a></li>
<li><a href="#org000001e">3.4. Base Packages</a></li>
<li><a href="#org0000021">3.5. Set Fonts</a></li>
<li><a href="#org000002d">3.6. Set Keybinds</a>
<ul>
<li><a href="#org0000024">3.6.1. Normal Keybinds</a></li>
<li><a href="#org0000027">3.6.2. Leader Keybinds</a></li>
<li><a href="#org000002a">3.6.3. Miscellaneous</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org000003f">4. Productivity Enhancers</a>
<ul>
<li><a href="#org0000033">4.1. Undo History</a></li>
<li><a href="#org0000036">4.2. Key &amp; Minibuffer completions</a></li>
<li><a href="#org0000039">4.3. Hop (Jump Anywhere on Buffer)</a></li>
<li><a href="#org000003c">4.4. AutoCompletion &amp; Snippets</a></li>
</ul>
</li>
<li><a href="#org0000045">5. Integrations</a>
<ul>
<li><a href="#org0000042">5.1. Remote Execution</a></li>
</ul>
</li>
<li><a href="#org0000057">6. Programming</a>
<ul>
<li><a href="#org0000048">6.1. Parinfer (Lisp Auto-Parenthesis)</a></li>
<li><a href="#org000004b">6.2. Highlighting</a></li>
<li><a href="#org000004e">6.3. AutoCompletion, CodeActions &amp; Snippets</a></li>
<li><a href="#org0000051">6.4. LSP</a></li>
<li><a href="#org0000054">6.5. Mermaid/GraphViz (Graph)</a></li>
</ul>
</li>
<li><a href="#org0000066">7. Add-ons</a>
<ul>
<li><a href="#org000005a">7.1. Embark</a></li>
<li><a href="#org000005d">7.2. Consult + Marginalia</a></li>
<li><a href="#org0000060">7.3. Better Help</a></li>
<li><a href="#org0000063">7.4. Chdir Support</a></li>
</ul>
</li>
<li><a href="#org0000072">8. Look &amp; Feel</a>
<ul>
<li><a href="#org0000069">8.1. Theme</a></li>
<li><a href="#org000006c">8.2. Org Export</a></li>
<li><a href="#org000006f">8.3. Highlight Todo</a></li>
</ul>
</li>
<li><a href="#org000008a">9. Misc</a>
<ul>
<li><a href="#org0000075">9.1. Don't reset the cursor to the middle when scrolling</a></li>
<li><a href="#org0000078">9.2. Highlight Trailing Whitespace</a></li>
<li><a href="#org000007b">9.3. Don't affect previous line with C-backspace</a></li>
<li><a href="#org000007e">9.4. Change backup file dump path</a></li>
<li><a href="#org0000081">9.5. Window Split Vertical-Horizontal Toggle</a></li>
<li><a href="#org0000084">9.6. open-at-point that opens respecting OS's default app for the link</a></li>
<li><a href="#org0000087">9.7. File closing prompt with evil-quit without saving won't show "Type C-h for help." in case wrong key is pressed.</a></li>
</ul>
</li>
<li><a href="#org000008d">10. Resources References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000006" class="outline-2">
<h2 id="org0000006"><span class="section-number-2">1.</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> Preface</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I was first introduced to Emacs by a friend at my college. I had been resistant to a lot of things in my life, like the
4-finger claw for playing mobile games, 10-finger touch typing on laptops, learning vim keybindings, and this time,
Emacs. I can only count how many times these things have saved me from a time-bubble burst. These seemingly obscure and
optional(-looking) things have indeed proven to be a few of the most influential aspects of my life.
</p>

<p>
<a href="https://www.csee.umbc.edu/resources/computer-science-help-center/resources-for-new-students/an-introduction-to-emacs">Emacs</a> holds a special place at the nucleus of my technological toolkit. All my workflows simplify down, because of its
indcredible ingrained &amp; integrable plugin ecosystem. You can't imagine any other software working so well for a variety
of use cases, sometimes even better than their recommended options. It has elevated my workflow as a programmer to a
whole new level.
</p>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.2.</span> Introduction</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This file, even though looking like a documentation or a book is indeed my emacs configuration!
(And also my ever updating notes while I'm learning emacs).
</p>

<p>
This is possible because of the org-babel plugin (inbuilt in Emacs as of now) that allows Emacs to contain code-blocks
within the org-mode documents. And this style of writing code within natural language is known as Literate Programming.
</p>

<p>
You can view my configuration at:
</p>
<ul class="org-ul">
<li><a href="https://animeshz.github.io/.emacs.d/">Website</a></li>
<li><a href="https://github.com/Animeshz/.emacs.d">GitHub</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0000012" class="outline-2">
<h2 id="org0000012"><span class="section-number-2">2.</span> Getting Started</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0000009" class="outline-3">
<h3 id="org0000009"><span class="section-number-3">2.1.</span> Installation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Install as you wish, I prefer using nix + home-manager for installation.
</p>

<div class="org-src-container">
<pre class="src src-nix">{ pkgs }:
{
  programs.emacs = {
    enable = true;
    package = pkgs.emacs29;

    extraPackages = epkgs: with epkgs; with pkgs; [
      custom.emacs-pcre
      custom.emacs-chdir
    ];
  };
}
</pre>
</div>

<p>
I export emacs-pcre and emacs-chdir as custom packages on my <a href="https://github.com/Animeshz/linux-desktop">nix config</a>.
</p>
</div>
</div>

<div id="outline-container-org000000c" class="outline-3">
<h3 id="org000000c"><span class="section-number-3">2.2.</span> Basic Keybinds</h3>
<div class="outline-text-3" id="text-2-2">
<p>
I like to remember a few keybinds so in-case my config had any error, I could still use emacs with these fallback
keybinds. And these keybinds are in general good enough for my hands as well hence I mostly don't change them.
</p>

<ul class="org-ul">
<li>C = Ctrl</li>
<li>M = Alt</li>
<li>S = Shift</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Scope</th>
<th scope="col" class="org-left">Keybind</th>
<th scope="col" class="org-left">Action</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">global</td>
<td class="org-left">M-x</td>
<td class="org-left">View Available Commands</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-x C-f</td>
<td class="org-left">Find File</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-h [f / v / k]</td>
<td class="org-left">Help on [functions / variables / key-chords]</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-x [2 / 3 / 0 / 1]</td>
<td class="org-left">Window Split [Down / Right / Close / Close All Except This]</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-x o / C-w C-w (Evil)</td>
<td class="org-left">Switch Window Split</td>
</tr>

<tr>
<td class="org-left">org-mode</td>
<td class="org-left">C-c C-c</td>
<td class="org-left">Run CodeBlock or Format Table</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-c C-l</td>
<td class="org-left">Insert Link</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-c C-,</td>
<td class="org-left">Insert Snippets</td>
</tr>

<tr>
<td class="org-left">minibuffer</td>
<td class="org-left">C-y</td>
<td class="org-left">Paste</td>
</tr>
</tbody>
</table>

<p>
<code>M-&lt;number&gt;</code> is a shorthand for <code>C-u &lt;number&gt;</code>, and is used to pass first argument <code>number</code> in interactive commands
via M-x or keybind.
</p>
</div>
</div>

<div id="outline-container-org000000f" class="outline-3">
<h3 id="org000000f"><span class="section-number-3">2.3.</span> Tutorials</h3>
<div class="outline-text-3" id="text-2-3">
<p>
I like to recommend <a href="https://www.youtube.com/watch?v=B6jfrrwR10k">this video</a> if you want to get familiarized with emacs! This packs a lot of information with
effective presentations instead of most videos which talk way too much and delivers barely anything useful.
</p>

<p>
<a href="https://www.youtube.com/playlist?list=PLlHHtPGox8K6bcuruX10Evf4AYGzYQKiz">This playlist</a> is good for getting quick short videos for further learning emacs on your own pace.
</p>
</div>
</div>
</div>

<div id="outline-container-org0000030" class="outline-2">
<h2 id="org0000030"><span class="section-number-2">3.</span> Emacs Configuration</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0000015" class="outline-3">
<h3 id="org0000015"><span class="section-number-3">3.1.</span> Early-Init and Init</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The <a href="./early-init.el">early-init.el</a> and <a href="./init.el">init.el</a> files are the first two files emacs read when starting up.
</p>

<p>
I kept them separated from this main configuration because the former do very naive stuffs
(such as basic ui changes and performance optimization), and the latter contains bootstrap code for Elpaca the package
manager which is a prerequisite for most of this config and also it loads this config in the end.
</p>
</div>
</div>
