config.org
** Better Defaults (Almost Mandatory)

Emacs requires some essential tweaks to become somewhat usable.

#+BEGIN_SRC emacs-lisp
;;; This file is generated from config.org | -*- lexical-binding: t; -*-

;; Enable minibuffer history, prioritizes M-x & vim commands with most recent commands issued
(setq history-length 100)
(savehist-mode 1)

;; Enable recording recent files & window configuration for going back and forth
(recentf-mode 1)  ; SPC-f-r
(winner-mode 1)   ; C-c [left / right]

;; Set relative lines
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)

;; Configure automatic line breaks and word-wrap (just in case)
(setq-default fill-column 120  ; SPC-c
              auto-fill-function 'do-auto-fill)
(global-visual-line-mode t)  ; SPC-w

;; I prefer indentation with spaces
(setq-default tab-width 4
              indent-tabs-mode nil)

;; Make scratch buffer text-mode
(setq-default initial-scratch-message nil
              initial-major-mode 'text-mode)

;; Replace yes/no with y/n
(setq use-short-answers t)

;; Modeline
(column-number-mode 1)
#+END_SRC

** Better Org-Mode Defaults

Same goes for =org-mode=.

#+BEGIN_SRC emacs-lisp
;; Allow these languages for code evaluation in org-mode documents
(org-babel-do-load-languages 'org-babel-load-languages
                             '((emacs-lisp . t) (shell . t) (python . t) (ruby . t) (C . t) (js . t)))  ; C-c C-c

;; Give org html export a deterministic id so it doesn't pollute git history
(defun my/org-deterministic-reference (references)
  (cl-loop for new from (length references) until (not (rassq new references))
           finally return new))
(advice-add #'org-export-new-reference :override #'my/org-deterministic-reference)
#+END_SRC

** Base Packages

These core packages are the scaffold upon which the entire configuration below is assembled.

#+BEGIN_SRC emacs-lisp
;; Used to set keybinds
(use-package general
  :config
  (general-override-mode)
  (general-auto-unbind-keys))

;; Emulates vim keybinds & modal editing
(use-package evil
  :init
  (setq evil-v$-excludes-newline t       ; $ in visual doesn't include \n
        evil-kill-on-visual-paste nil    ; pasting in visual mode won't copy replaced text to clipboard
        evil-auto-indent nil             ; o and O doesn't add indents
        evil-cross-lines t               ; h and l to move to newline
        ;; evil-respect-visual-line-mode t  ; physical line as $ anchor instead of \n, caveat: dj dk doesn't work as intended
        evil-shift-width tab-width       ; << and >>
        evil-want-keybinding nil         ; required by =evil-collection=
        evil-split-window-below t
        evil-vsplit-window-right t)
  :config
  (evil-mode 1))

;; Extend support of vim keybindings on to various other packages
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(elpaca-wait)
#+END_SRC

The =evil= package provides Vim's Modal Editing in Emacs. I have notes on [[https://animeshz.github.io/site/notes/20-29--DevEnvironment/21--Linux/21.03-Cli-Utilities.html#n-vim][the only Vim keybind you need to know]] on my
site.

** Set Fonts

Set global font, whichever is available in the =preferred-fonts=.

#+BEGIN_SRC emacs-lisp
(defvar preferred-fonts
  (list "CaskaydiaCove Nerd Font Mono" "Fira Code Mono" "Jetbrains Mono"))

(custom-set-faces
 '(default ((t (:family (cl-find-if font-info preferred-fonts) :height 120)))))
#+END_SRC

I didn't set =variable-pitch= and =fixed-pitch= faces separately and forced Mono font everywhere, although that's also
an option.

