index.html

<div id="outline-container-org0000018" class="outline-3">
<h3 id="org0000018"><span class="section-number-3">3.2.</span> Better Defaults (Almost Mandatory)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Emacs requires some essential tweaks to become somewhat usable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">This file is generated from config.org | -*- lexical-binding: t; -*-</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Enable minibuffer history, prioritizes M-x &amp; vim commands with most recent commands issued</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> history-length 100)
(savehist-mode 1)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Enable recording recent files &amp; window configuration for going back and forth</span>
(recentf-mode 1)  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">SPC-f-r</span>
(winner-mode 1)   <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">C-c [left / right]</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Set relative lines</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> display-line-numbers-type 'relative)
(global-display-line-numbers-mode t)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Configure automatic line breaks and word-wrap (just in case)</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> fill-column 120  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">SPC-c</span>
              auto-fill-function 'do-auto-fill)
(global-visual-line-mode t)  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">SPC-w</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">I prefer indentation with spaces</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> tab-width 4
              indent-tabs-mode nil)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Make scratch buffer text-mode</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> initial-scratch-message nil
              initial-major-mode 'text-mode)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Replace yes/no with y/n</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> use-short-answers t)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Modeline</span>
(column-number-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org000001b" class="outline-3">
<h3 id="org000001b"><span class="section-number-3">3.3.</span> Better Org-Mode Defaults</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Same goes for <code>org-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Allow these languages for code evaluation in org-mode documents</span>
(org-babel-do-load-languages 'org-babel-load-languages
                             '((emacs-lisp . t) (shell . t) (python . t) (ruby . t) (C . t) (js . t)))  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">C-c C-c</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Give org html export a deterministic id so it doesn't pollute git history</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/org-deterministic-reference</span> (references)
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cl-loop</span> for new from (length references) until (not (rassq new references))
           finally return new))
(advice-add #'org-export-new-reference <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:override</span> #'my/org-deterministic-reference)
</pre>
</div>
</div>
</div>

<div id="outline-container-org000001e" class="outline-3">
<h3 id="org000001e"><span class="section-number-3">3.4.</span> Base Packages</h3>
<div class="outline-text-3" id="text-3-4">
<p>
These core packages are the scaffold upon which the entire configuration below is assembled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Used to set keybinds</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">general</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (general-override-mode)
  (general-auto-unbind-keys))

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Emulates vim keybinds &amp; modal editing</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> evil-v$-excludes-newline t       <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">$ in visual doesn't include \n</span>
        evil-kill-on-visual-paste nil    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">pasting in visual mode won't copy replaced text to clipboard</span>
        evil-auto-indent nil             <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">o and O doesn't add indents</span>
        evil-cross-lines t               <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">h and l to move to newline</span>
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">evil-respect-visual-line-mode t  ; physical line as $ anchor instead of \n, caveat: dj dk doesn't work as intended</span>
        evil-shift-width tab-width       <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">&lt;&lt; and &gt;&gt;</span>
        evil-want-keybinding nil         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">required by =evil-collection=</span>
        evil-split-window-below t
        evil-vsplit-window-right t)
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (evil-mode 1))

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Extend support of vim keybindings on to various other packages</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">evil-collection</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:after</span> evil
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (evil-collection-init))

(elpaca-wait)
</pre>
</div>

<p>
The <code>evil</code> package provides Vim's Modal Editing in Emacs. I have notes on <a href="https://animeshz.github.io/site/notes/20-29--DevEnvironment/21--Linux/21.03-Cli-Utilities.html#n-vim">the only Vim keybind you need to know</a> on my
site.
</p>
</div>
</div>

<div id="outline-container-org0000021" class="outline-3">
<h3 id="org0000021"><span class="section-number-3">3.5.</span> Set Fonts</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Set global font, whichever is available in the <code>preferred-fonts</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">preferred-fonts</span>
  (list <span style="color: var(--clr-string); background-color: var(--bg-string);">"CaskaydiaCove Nerd Font Mono"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Fira Code Mono"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Jetbrains Mono"</span>))

(custom-set-faces
 '(default ((t (<span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:family</span> (cl-find-if font-info preferred-fonts) <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:height</span> 120)))))
</pre>
</div>

<p>
I didn't set <code>variable-pitch</code> and <code>fixed-pitch</code> faces separately and forced Mono font everywhere, although that's also
an option.
</p>
</div>
</div>
