config.org
** Set Keybinds

General keybinds which are not specific to any package.

With evil we have 2 things, evil states (namely normal, motion, visutal, etc) and mode-map. In emacs, everything we edit
(the buffer) has a major mode (e.g. prog-mode) and multiple minor modes (e.g. winner-mode, rust-mode) enabled through
file extension or hooks, each of these modes have a mode-map associated in order to set keybinds in buffers with those
modes enabled. Read more about them [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Modes.html][here]].

*** Normal Keybinds

Keybinds without prefix.

#+BEGIN_SRC emacs-lisp
(general-def '(normal motion visual operator)
  ;; Adjust font size
  "C-+" #'text-scale-increase
  "C-_" #'text-scale-decrease

  ;; Move lines without moving cursor
  "," #'evil-scroll-line-down
  "." #'evil-scroll-line-up

  ;; Indent region (same keybind as vscode lol)
  "C-S-i" '(lambda () (interactive) (indent-region (point-min) (point-max)))

  "<escape>" #'keyboard-escape-quit)
#+END_SRC

*** Leader Keybinds

Keybinds with =SPC= prefix.

#+BEGIN_SRC emacs-lisp
(general-create-definer leader-key
  :states '(normal motion visual operator emacs)
  :keymaps 'override
  :prefix "SPC")

(leader-key
  "ff" #'find-file
  "fr" #'recentf-open
  "tw" #'delete-trailing-whitespace
  "ev" #'eval-region
  "x" #'kill-this-buffer
  "r" #'revert-buffer
  "c" #'display-fill-column-indicator-mode
  "s" #'switch-to-buffer
  "d" #'bookmark-jump
  "w" #'visual-line-mode  ; toggle word-wrap
  "p" #'projectile-command-map
  "/" #'comment-dwim)
#+END_SRC

*** Miscellaneous

Ergonomic UX on insert-like modes,

#+BEGIN_SRC emacs-lisp
(general-def 'insert
  "<tab>" #'tab-to-tab-stop
  "C-S-v" #'evil-paste-before-cursor-after)

(general-def '(isearch-mode-map)
  "C-S-v" #'isearch-yank-kill)

(general-def '(minibuffer-mode-map)
  "C-S-v" #'yank)
#+END_SRC

Some org mode enhancements

#+BEGIN_SRC emacs-lisp
;; Toggle folding org headings with tab/ret
(general-def 'normal org-mode-map
  "<tab>" #'evil-toggle-fold
  "<RET>" '(lambda ()
             (interactive)
             (cond
              ((org-at-heading-p) (evil-toggle-fold))
              ((org-in-regexp org-link-any-re) (org-open-at-point))
              (t (evil-ret)))))
#+END_SRC

* Productivity Enhancers

** Undo History

Preserving undo history is probably the first productivity enhancer I can think of.

#+BEGIN_SRC emacs-lisp
;; keep undo history
(use-package undo-fu
  :config
  (general-setq evil-undo-system 'undo-fu))

;; keep file's undo history between emacs sessions
(use-package undo-fu-session
  :config
  (undo-fu-session-global-mode))

;; make undo history a tree on-the-fly
(use-package vundo
  :ensure (vundo :host github :repo "casouri/vundo")
  :config
  (general-def 'normal vundo-mode-map "<escape>" #'vundo-quit))
#+END_SRC

