index.html

<div id="outline-container-org000002d" class="outline-3">
<h3 id="org000002d"><span class="section-number-3">3.6.</span> Set Keybinds</h3>
<div class="outline-text-3" id="text-3-6">
<p>
General keybinds which are not specific to any package.
</p>

<p>
With evil we have 2 things, evil states (namely normal, motion, visutal, etc) and mode-map. In emacs, everything we edit
(the buffer) has a major mode (e.g. prog-mode) and multiple minor modes (e.g. winner-mode, rust-mode) enabled through
file extension or hooks, each of these modes have a mode-map associated in order to set keybinds in buffers with those
modes enabled. Read more about them <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Modes.html">here</a>.
</p>
</div>

<div id="outline-container-org0000024" class="outline-4">
<h4 id="org0000024"><span class="section-number-4">3.6.1.</span> Normal Keybinds</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
Keybinds without prefix.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> '(normal motion visual operator)
  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Adjust font size</span>
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-+"</span> #'text-scale-increase
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-_"</span> #'text-scale-decrease

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Move lines without moving cursor</span>
  <span style="color: var(--clr-string); background-color: var(--bg-string);">","</span> #'evil-scroll-line-down
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"."</span> #'evil-scroll-line-up

  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Indent region (same keybind as vscode lol)</span>
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-S-i"</span> '(lambda () (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span>) (indent-region (point-min) (point-max)))

  <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;escape&gt;"</span> #'keyboard-escape-quit)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000027" class="outline-4">
<h4 id="org0000027"><span class="section-number-4">3.6.2.</span> Leader Keybinds</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
Keybinds with <code>SPC</code> prefix.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-create-definer</span> leader-key
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:states</span> '(normal motion visual operator emacs)
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:keymaps</span> 'override
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:prefix</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"SPC"</span>)

(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">leader-key</span>
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"ff"</span> #'find-file
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"fr"</span> #'recentf-open
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"tw"</span> #'delete-trailing-whitespace
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"ev"</span> #'eval-region
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"x"</span> #'kill-this-buffer
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"r"</span> #'revert-buffer
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"c"</span> #'display-fill-column-indicator-mode
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"s"</span> #'switch-to-buffer
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"d"</span> #'bookmark-jump
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"w"</span> #'visual-line-mode  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">toggle word-wrap</span>
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"p"</span> #'projectile-command-map
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"/"</span> #'comment-dwim)
</pre>
</div>
</div>
</div>

<div id="outline-container-org000002a" class="outline-4">
<h4 id="org000002a"><span class="section-number-4">3.6.3.</span> Miscellaneous</h4>
<div class="outline-text-4" id="text-3-6-3">
<p>
Ergonomic UX on insert-like modes,
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> 'insert
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt;"</span> #'tab-to-tab-stop
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-S-v"</span> #'evil-paste-before-cursor-after)

(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> '(isearch-mode-map)
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-S-v"</span> #'isearch-yank-kill)

(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> '(minibuffer-mode-map)
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"C-S-v"</span> #'yank)
</pre>
</div>

<p>
Some org mode enhancements
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Toggle folding org headings with tab/ret</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> 'normal org-mode-map
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;tab&gt;"</span> #'evil-toggle-fold
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;RET&gt;"</span> '(lambda ()
             (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span>)
             (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span>
              ((org-at-heading-p) (evil-toggle-fold))
              ((org-in-regexp org-link-any-re) (org-open-at-point))
              (t (evil-ret)))))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org000003f" class="outline-2">
<h2 id="org000003f"><span class="section-number-2">4.</span> Productivity Enhancers</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0000033" class="outline-3">
<h3 id="org0000033"><span class="section-number-3">4.1.</span> Undo History</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Preserving undo history is probably the first productivity enhancer I can think of.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">keep undo history</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">undo-fu</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-setq</span> evil-undo-system 'undo-fu))

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">keep file's undo history between emacs sessions</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">undo-fu-session</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (undo-fu-session-global-mode))

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">make undo history a tree on-the-fly</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">vundo</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ensure</span> (vundo <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:host</span> github <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:repo</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"casouri/vundo"</span>)
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> 'normal vundo-mode-map <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;escape&gt;"</span> #'vundo-quit))
</pre>
</div>
</div>
</div>
