config.org
** Key & Minibuffer completions

This is really important as my memory is dum dum.

#+BEGIN_SRC emacs-lisp
;; Shows valid key combinations after a key-press
(use-package which-key
  :config
  (setq which-key-idle-delay 0.4)
  (which-key-mode))
#+END_SRC

Completion over M-x and other help panels.

#+BEGIN_SRC emacs-lisp
;; Transforms prompts into selectable panels
(use-package vertico
  :config
  (setq vertico-count 20
        vertico-resize nil
        vertico-cycle t)
  (vertico-mode))

;; Allows partial, unordered and regex search on those panels
(use-package orderless
  :config
  (setq completion-styles '(orderless basic)))
#+END_SRC

** Hop (Jump Anywhere on Buffer)

This was my most missing feature from nvim, so much so I wrote this package myself. Read more on [[https://github.com/Animeshz/hop.el][hop.el]].

#+BEGIN_SRC emacs-lisp
(require 'pcre)

(use-package hop
  :ensure (hop :host github :repo "Animeshz/hop.el")
  :config
  (general-def '(normal motion visual operator)
    "go" #'hop-word
    "gl" #'hop-char
    "gp" #'hop-regex-pattern
    "gk" #'hop-line))
#+END_SRC

** AutoCompletion & Snippets

Woah, now we want to speed up!

#+BEGIN_SRC emacs-lisp
;; Inline completions frontend
(use-package company
  :config
  (setq company-idle-delay 0
        company-show-numbers t)
  (global-company-mode 1))
#+END_SRC

Now let's add a few completion backends.

#+BEGIN_SRC emacs-lisp
;; Tabnine is my choice!
(use-package company-tabnine)

;; Add snippets to the stack!
(use-package yasnippet
  :config
  (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
  (leader-key "ns" #'yas-new-snippet)
  (yas-global-mode 1))
#+END_SRC

Setup company at the end of everything, so multiple backends can be grouped and prioritized.

#+BEGIN_SRC emacs-lisp
(defun setup-company ()
  (setq company-backends '((company-yasnippet))))
(add-hook 'elpaca-after-init-hook #'setup-company)

;; Tabnine may not sometimes keep up with my typing speed, so I may wanna toggle it often with SPC-t-n
(defun toggle-tabnine ()
  (interactive)
  (setq company-backends
        (cond ((equal company-backends '((company-yasnippet))) '((company-tabnine :with company-yasnippet)))
              (t '((company-yasnippet))))))
(leader-key
  "tn" #'toggle-tabnine)
#+END_SRC

* Integrations

** Remote Execution

* Programming

** Parinfer (Lisp Auto-Parenthesis)

#+BEGIN_SRC emacs-lisp
;; (use-package parinfer-rust-mode
;;   :hook '(emacs-lisp-mode)
;;   :init
;;   (setq parinfer-rust-auto-download t)
;;   (setq parinfer-rust-troublesome-modes nil)
;;   :config
;;   (defun my-enable-minor-mode-for-special-file ()
;;     "Enable my-minor-mode for my-special-file.txt."
;;     (message "%s" (buffer-name))
;;     (when (string= (buffer-name) "config.org")
;;       (parinfer-rust-mode)))
;;   (add-hook 'find-file-hook 'my-enable-minor-mode-for-special-file))
#+END_SRC

