index.html

<div id="outline-container-org0000036" class="outline-3">
<h3 id="org0000036"><span class="section-number-3">4.2.</span> Key &amp; Minibuffer completions</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This is really important as my memory is dum dum.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Shows valid key combinations after a key-press</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">which-key</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> which-key-idle-delay 0.4)
  (which-key-mode))
</pre>
</div>

<p>
Completion over M-x and other help panels.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Transforms prompts into selectable panels</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">vertico</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> vertico-count 20
        vertico-resize nil
        vertico-cycle t)
  (vertico-mode))

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Allows partial, unordered and regex search on those panels</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">orderless</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> completion-styles '(orderless basic)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000039" class="outline-3">
<h3 id="org0000039"><span class="section-number-3">4.3.</span> Hop (Jump Anywhere on Buffer)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This was my most missing feature from nvim, so much so I wrote this package myself. Read more on <a href="https://github.com/Animeshz/hop.el">hop.el</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">require</span> '<span style="color: var(--clr-constant); background-color: var(--bg-constant);">pcre</span>)

(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">hop</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:ensure</span> (hop <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:host</span> github <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:repo</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Animeshz/hop.el"</span>)
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">general-def</span> '(normal motion visual operator)
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"go"</span> #'hop-word
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"gl"</span> #'hop-char
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"gp"</span> #'hop-regex-pattern
    <span style="color: var(--clr-string); background-color: var(--bg-string);">"gk"</span> #'hop-line))
</pre>
</div>
</div>
</div>

<div id="outline-container-org000003c" class="outline-3">
<h3 id="org000003c"><span class="section-number-3">4.4.</span> AutoCompletion &amp; Snippets</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Woah, now we want to speed up!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Inline completions frontend</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">company</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-idle-delay 0
        company-show-numbers t)
  (global-company-mode 1))
</pre>
</div>

<p>
Now let's add a few completion backends.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Tabnine is my choice!</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">company-tabnine</span>)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Add snippets to the stack!</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">yasnippet</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> yas-snippet-dirs '(<span style="color: var(--clr-string); background-color: var(--bg-string);">"~/.emacs.d/snippets"</span>))
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">leader-key</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"ns"</span> #'yas-new-snippet)
  (yas-global-mode 1))
</pre>
</div>

<p>
Setup company at the end of everything, so multiple backends can be grouped and prioritized.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">setup-company</span> ()
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-backends '((company-yasnippet))))
(add-hook 'elpaca-after-init-hook #'setup-company)

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Tabnine may not sometimes keep up with my typing speed, so I may wanna toggle it often with SPC-t-n</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">toggle-tabnine</span> ()
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span>)
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> company-backends
        (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span> ((equal company-backends '((company-yasnippet))) '((company-tabnine <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:with</span> company-yasnippet)))
              (t '((company-yasnippet))))))
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">leader-key</span>
  <span style="color: var(--clr-string); background-color: var(--bg-string);">"tn"</span> #'toggle-tabnine)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0000045" class="outline-2">
<h2 id="org0000045"><span class="section-number-2">5.</span> Integrations</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0000042" class="outline-3">
<h3 id="org0000042"><span class="section-number-3">5.1.</span> Remote Execution</h3>
</div>
</div>

<div id="outline-container-org0000057" class="outline-2">
<h2 id="org0000057"><span class="section-number-2">6.</span> Programming</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org0000048" class="outline-3">
<h3 id="org0000048"><span class="section-number-3">6.1.</span> Parinfer (Lisp Auto-Parenthesis)</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(use-package parinfer-rust-mode</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:hook '(emacs-lisp-mode)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:init</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq parinfer-rust-auto-download t)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq parinfer-rust-troublesome-modes nil)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(defun my-enable-minor-mode-for-special-file ()</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;     </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">"Enable my-minor-mode for my-special-file.txt."</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;     </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(message "%s" (buffer-name))</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;     </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(when (string= (buffer-name) "config.org")</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;       </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(parinfer-rust-mode)))</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(add-hook 'find-file-hook 'my-enable-minor-mode-for-special-file))</span>
</pre>
</div>
</div>
</div>
