config.org
** Highlighting

#+BEGIN_SRC emacs-lisp
;; (use-package nix-mode
;;   :mode "\\.nix\\'")
(use-package markdown-mode
  :mode "\\.md\\'")
;; (use-package kotlin-mode
;;   :mode "\\.kt\\|\\.kts\\'")
#+END_SRC

** AutoCompletion, CodeActions & Snippets

#+BEGIN_SRC emacs-lisp
;; (use-package projectile
;;   :init
;;   (projectile-mode +1)
;;   :config
;;   (define-key projectile-command-map (kbd "ESC") 'keyboard-escape-quit))

;; (use-package corfu
;;   :ensure (corfu :host github :repo "minad/corfu" :files (:defaults "extensions/*.el"))
;;   :config
;;   ;; Setup corfu for popup like completion
;;   (setq corfu-cycle t  ; Allows cycling through candidates
;;         corfu-auto t   ; Enable auto completion
;;         corfu-auto-prefix 0  ; Complete with less prefix keys
;;         corfu-auto-delay 0.0  ; No delay for completion
;;         corfu-echo-documentation t ; Echo docs for current completion option
;;         corfu-popupinfo-delay 0.0
;;         corfu-quit-no-match 'separator
;;         corfu-quit-at-boundary 'insert)

;;   ;; Silence the pcomplete capf, no errors or messages!
;;   (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)

;;   ;; Ensure that pcomplete does not write to the buffer
;;   ;; and behaves as a pure `completion-at-point-function'.
;;   (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)
;;   (global-corfu-mode 1)
;;   (corfu-popupinfo-mode 1))
#+END_SRC

** LSP

#+BEGIN_SRC emacs-lisp
;; (use-package eglot
;;   :hook (prog-mode . eglot-ensure)
;;   :config
;;   (setq debug-on-error nil)
;;   (add-to-list 'eglot-server-programs '(kotlin-mode . ("kotlin-language-server")))
;;   (define-key eglot-mode-map (kbd "C-c r") 'eglot-rename)
;;   (define-key eglot-mode-map (kbd "C-c o") 'eglot-code-action-organize-imports)
;;   (define-key eglot-mode-map (kbd "C-c h") 'eldoc)
;;   (define-key eglot-mode-map (kbd "<f6>") 'xref-find-definitions))
#+END_SRC

** Mermaid/GraphViz (Graph)

#+BEGIN_SRC emacs-lisp
(use-package mermaid-mode)
(use-package ob-mermaid
  :config
  (add-hook 'org-babel-after-execute-hook (lambda ()
                                            (org-redisplay-inline-images)))
  (setq org-startup-with-inline-images t)
  (setq org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages 'org-babel-load-languages '((mermaid . t))))

(use-package graphviz-dot-mode
  :config
  (org-babel-do-load-languages 'org-babel-load-languages '((dot . t))))

(use-package ob-svgbob)
#+END_SRC

* Add-ons

