index.html

<div id="outline-container-org000004b" class="outline-3">
<h3 id="org000004b"><span class="section-number-3">6.2.</span> Highlighting</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(use-package nix-mode</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:mode "\\.nix\\'")</span>
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">markdown-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:mode</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.md\\'"</span>)
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">kotlin-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:mode</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\.kt</span><span style="color: #5EC4FF; background-color: var(--bg-string); font-weight: bold;">\\</span><span style="color: #5EC4FF; background-color: var(--bg-string); font-weight: bold;">|</span><span style="color: var(--clr-string); background-color: var(--bg-string);">\\.kts\\'"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org000004e" class="outline-3">
<h3 id="org000004e"><span class="section-number-3">6.3.</span> AutoCompletion, CodeActions &amp; Snippets</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(use-package projectile</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:init</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(projectile-mode +1)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(define-key projectile-command-map (kbd "ESC") 'keyboard-escape-quit))</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(use-package corfu</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:ensure (corfu :host github :repo "minad/corfu" :files (:defaults "extensions/*.el"))</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">;; Setup corfu for popup like completion</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq corfu-cycle t  ; Allows cycling through candidates</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-auto t   ; Enable auto completion</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-auto-prefix 0  ; Complete with less prefix keys</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-auto-delay 0.0  ; No delay for completion</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-echo-documentation t ; Echo docs for current completion option</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-popupinfo-delay 0.0</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-quit-no-match 'separator</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;         </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">corfu-quit-at-boundary 'insert)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">;; Silence the pcomplete capf, no errors or messages!</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)</span>

<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">;; Ensure that pcomplete does not write to the buffer</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">;; and behaves as a pure `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">completion-at-point-function</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">'.</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(global-corfu-mode 1)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(corfu-popupinfo-mode 1))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000051" class="outline-3">
<h3 id="org0000051"><span class="section-number-3">6.4.</span> LSP</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(use-package eglot</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:hook (prog-mode . eglot-ensure)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">:config</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(setq debug-on-error nil)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(add-to-list 'eglot-server-programs '(kotlin-mode . ("kotlin-language-server")))</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(define-key eglot-mode-map (kbd "C-c r") 'eglot-rename)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(define-key eglot-mode-map (kbd "C-c o") 'eglot-code-action-organize-imports)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(define-key eglot-mode-map (kbd "C-c h") 'eldoc)</span>
<span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;   </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(define-key eglot-mode-map (kbd "&lt;f6&gt;") 'xref-find-definitions))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000054" class="outline-3">
<h3 id="org0000054"><span class="section-number-3">6.5.</span> Mermaid/GraphViz (Graph)</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">mermaid-mode</span>)
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">ob-mermaid</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (add-hook 'org-babel-after-execute-hook (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> ()
                                            (org-redisplay-inline-images)))
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-startup-with-inline-images t)
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages 'org-babel-load-languages '((mermaid . t))))

(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">graphviz-dot-mode</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:config</span>
  (org-babel-do-load-languages 'org-babel-load-languages '((dot . t))))

(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">ob-svgbob</span>)
</pre>
</div>
</div>
</div>
</div>
