config.org
** Highlight Todo

#+BEGIN_SRC emacs-lisp
(use-package hl-todo
  :hook ((prog-mode org-mode) . hl-todo-mode)
  :init
  (setq hl-todo-keyword-faces '(("HOLD" . "#cfdf30")
                                ("TODO" . "#ff9977")
                                ("NEXT" . "#b6a0ff")
                                ("PROG" . "#00d3d0")
                                ("FIXME" . "#ff9977")
                                ("DONE" . "#44bc44")
                                ("REVIEW" . "#6ae4b9")
                                ("DEPRECATED" . "#bfd9ff"))))
#+END_SRC

* Miscellaneous

** Don't reset the cursor to the middle when scrolling

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 '(scroll-conservatively 200)
 '(scroll-margin 3))
#+END_SRC

** Highlight Trailing Whitespace

#+BEGIN_SRC emacs-lisp
(setq-default show-trailing-whitespace t)
(add-hook 'prog-mode-hook
          (lambda () (font-lock-add-keywords nil '(("\\s-+$" 0 'trailing-whitespace)))))
#+END_SRC

** Don't affect previous line with C-backspace

#+BEGIN_SRC emacs-lisp
(defun my/backward-kill-word ()
  "Kill backward to the beginning of the current word, but do not cross lines."
  (interactive)
  (if (not (looking-back "^\\s-*")) (backward-kill-word 1) (delete-horizontal-space)))

(global-set-key (kbd "<C-backspace>") 'my/backward-kill-word)
#+END_SRC

** Change backup file dump path

#+BEGIN_SRC emacs-lisp
(defvar user-temporary-file-directory
  (concat temporary-file-directory user-login-name "/"))
(make-directory user-temporary-file-directory t)
(setq backup-by-copying t)
(setq backup-directory-alist
      `(("." . ,user-temporary-file-directory)
        (,tramp-file-name-regexp nil)))
(setq auto-save-list-file-prefix
      (concat user-temporary-file-directory ".auto-saves-"))
(setq auto-save-file-name-transforms
      `((".*" ,user-temporary-file-directory t)))
#+END_SRC

** Window Split Vertical-Horizontal Toggle

#+BEGIN_SRC emacs-lisp
(defun window-split-toggle ()
  "Toggle between horizontal and vertical split with two windows."
  (interactive)
  (if (> (length (window-list)) 2)
      (error "Can't toggle with more than 2 windows!")
    (let ((func (if (window-full-height-p)
                    #'split-window-vertically
                  #'split-window-horizontally)))
      (delete-other-windows)
      (funcall func)
      (save-selected-window
        (other-window 1)
        (switch-to-buffer (other-buffer))))))
(leader-key
  "ts" #'window-split-toggle)
#+END_SRC

