index.html

<div id="outline-container-org000006f" class="outline-3">
<h3 id="org000006f"><span class="section-number-3">8.3.</span> Highlight Todo</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">use-package</span> <span style="color: var(--clr-constant); background-color: var(--bg-constant);">hl-todo</span>
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:hook</span> ((prog-mode org-mode) . hl-todo-mode)
  <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:init</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> hl-todo-keyword-faces '((<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #cfdf30; background-color: var(--bg-string); font-weight: bold;">HOLD</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#cfdf30"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #ff9977; background-color: var(--bg-string); font-weight: bold;">TODO</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#ff9977"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #b6a0ff; background-color: var(--bg-string); font-weight: bold;">NEXT</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#b6a0ff"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #00d3d0; background-color: var(--bg-string); font-weight: bold;">PROG</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#00d3d0"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #ff9977; background-color: var(--bg-string); font-weight: bold;">FIXME</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#ff9977"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #44bc44; background-color: var(--bg-string); font-weight: bold;">DONE</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#44bc44"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #6ae4b9; background-color: var(--bg-string); font-weight: bold;">REVIEW</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#6ae4b9"</span>)
                                (<span style="color: var(--clr-string); background-color: var(--bg-string);">"</span><span style="color: #bfd9ff; background-color: var(--bg-string); font-weight: bold;">DEPRECATED</span><span style="color: var(--clr-string); background-color: var(--bg-string);">"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"#bfd9ff"</span>))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org000008a" class="outline-2">
<h2 id="org000008a"><span class="section-number-2">9.</span> Misc</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org0000075" class="outline-3">
<h3 id="org0000075"><span class="section-number-3">9.1.</span> Don't reset the cursor to the middle when scrolling</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(custom-set-variables
 '(scroll-conservatively 200)
 '(scroll-margin 3))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000078" class="outline-3">
<h3 id="org0000078"><span class="section-number-3">9.2.</span> Highlight Trailing Whitespace</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq-default</span> show-trailing-whitespace t)
(add-hook 'prog-mode-hook
          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> () (font-lock-add-keywords nil '((<span style="color: var(--clr-string); background-color: var(--bg-string);">"\\s-+$"</span> 0 'trailing-whitespace)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org000007b" class="outline-3">
<h3 id="org000007b"><span class="section-number-3">9.3.</span> Don't affect previous line with C-backspace</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">my/backward-kill-word</span> ()
  <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Kill backward to the beginning of the current word, but do not cross lines."</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span>)
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (not (looking-back <span style="color: var(--clr-string); background-color: var(--bg-string);">"^\\s-*"</span>)) (backward-kill-word 1) (delete-horizontal-space)))

(global-set-key (kbd <span style="color: var(--clr-string); background-color: var(--bg-string);">"&lt;C-backspace&gt;"</span>) 'my/backward-kill-word)
</pre>
</div>
</div>
</div>

<div id="outline-container-org000007e" class="outline-3">
<h3 id="org000007e"><span class="section-number-3">9.4.</span> Change backup file dump path</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defvar</span> <span style="color: var(--clr-variable); background-color: var(--bg-variable);">user-temporary-file-directory</span>
  (concat temporary-file-directory user-login-name <span style="color: var(--clr-string); background-color: var(--bg-string);">"/"</span>))
(make-directory user-temporary-file-directory t)
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> backup-by-copying t)
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> backup-directory-alist
      `((<span style="color: var(--clr-string); background-color: var(--bg-string);">"."</span> . ,user-temporary-file-directory)
        (,tramp-file-name-regexp nil)))
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> auto-save-list-file-prefix
      (concat user-temporary-file-directory <span style="color: var(--clr-string); background-color: var(--bg-string);">".auto-saves-"</span>))
(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> auto-save-file-name-transforms
      `((<span style="color: var(--clr-string); background-color: var(--bg-string);">".*"</span> ,user-temporary-file-directory t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000081" class="outline-3">
<h3 id="org0000081"><span class="section-number-3">9.5.</span> Window Split Vertical-Horizontal Toggle</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">window-split-toggle</span> ()
  <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Toggle between horizontal and vertical split with two windows."</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span>)
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (&gt; (length (window-list)) 2)
      (<span style="color: #EBBF83;">error</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"Can't toggle with more than 2 windows!"</span>)
    (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((func (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (window-full-height-p)
                    #'split-window-vertically
                  #'split-window-horizontally)))
      (delete-other-windows)
      (funcall func)
      (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-selected-window</span>
        (other-window 1)
        (switch-to-buffer (other-buffer))))))
</pre>
</div>
</div>
</div>
