index.html

<div id="outline-container-org0000084" class="outline-3">
<h3 id="org0000084"><span class="section-number-3">9.6.</span> open-at-point that opens respecting OS's default app for the link</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">open-at-point</span> ()
  <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Open URL at point."</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">interactive</span>)
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let*</span> ((link-regexp <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\[\\[</span><span style="color: #5EC4FF; background-color: var(--bg-string); font-weight: bold;">\\</span><span style="color: #5EC4FF; background-color: var(--bg-string); font-weight: bold;">(</span><span style="color: var(--clr-string); background-color: var(--bg-string);">.*?</span><span style="color: #5EC4FF; background-color: var(--bg-string); font-weight: bold;">\\</span><span style="color: #5EC4FF; background-color: var(--bg-string); font-weight: bold;">)</span><span style="color: var(--clr-string); background-color: var(--bg-string);">\\]\\[</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">.*?\\</span><span style="color: var(--clr-string); background-color: var(--bg-string);">]\\]"</span>)
         (link (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">save-excursion</span>
                 (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> (re-search-backward link-regexp nil t)
                   (match-string 1)))))
    (message <span style="color: var(--clr-string); background-color: var(--bg-string);">"%s"</span> link)
    (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span>
     ((string-equal system-type <span style="color: var(--clr-string); background-color: var(--bg-string);">"windows-nt"</span>)
      (w32-shell-execute <span style="color: var(--clr-string); background-color: var(--bg-string);">"open"</span> (replace-regexp-in-string <span style="color: var(--clr-string); background-color: var(--bg-string);">"/"</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"\\"</span> link t t)))
     ((string-equal system-type <span style="color: var(--clr-string); background-color: var(--bg-string);">"darwin"</span>)
      (shell-command (format <span style="color: var(--clr-string); background-color: var(--bg-string);">"open \"%s\""</span> link)))
     ((string-equal system-type <span style="color: var(--clr-string); background-color: var(--bg-string);">"gnu/linux"</span>)
      (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((process-connection-type nil)) (start-process <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span> nil <span style="color: var(--clr-string); background-color: var(--bg-string);">"xdg-open"</span> link))))))
</pre>
</div>
</div>
</div>
