index.html

<div id="outline-container-org0000087" class="outline-3">
<h3 id="org0000087"><span class="section-number-3">9.7.</span> File closing prompt with evil-quit without saving won't show "Type C-h for help." in case wrong key is pressed.</h3>
<div class="outline-text-3" id="text-9-7">
<p>
Redefining the funcion at emacs/lisp/emacs-lisp/map-ynp.el, with some lines commented out.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">defun</span> <span style="color: var(--function-clr-name); background-color: var(--function-bg-name);">map-y-or-n-p</span> (prompter actor list <span style="color: #EBBF83;">&amp;optional</span> help action-alist
                              no-cursor-in-echo-area)
  <span style="color: var(--clr-doc); background-color: var(--bg-doc);">"Ask a boolean question per PROMPTER for each object in LIST, then call ACTOR.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      LIST is a list of objects, or a function of no arguments to return the next</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      object; when it returns nil, the list of objects is considered exhausted.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      If PROMPTER is a string, it should be a format string to be used to format</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      the question as </span><span style="color: #EBBF83; background-color: var(--bg-doc);">\</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">(format PROMPTER OBJECT).</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      If PROMPTER is not a string, it should be a function of one argument, an</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      object from LIST, which returns a string to be used as the question for</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      that object.  If the function's return value is not a string, it may be</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      nil to ignore the object, or non-nil to act on the object with ACTOR</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      without asking the user.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      ACTOR is a function of one argument, an object from LIST,</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      which gets called with each object for which the user answers `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">yes</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">'</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      to the question presented by PROMPTER.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      The user's answers to the questions may be one of the following:</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">       - y, Y, or SPC to act on that object;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">       - n, N, or DEL to skip that object;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">       - ! to act on all following objects;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">       - ESC or q to exit (skip all following objects);</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">       - . (period) to act on the current object and then exit; or</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">       - \\[</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">help-command</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">] to get help.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      HELP provides information for displaying help when the user</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      types \\[</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">help-command</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">].  If HELP is given, it should be a list of</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      the form (OBJECT OBJECTS ACTION), where OBJECT is a string giving</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      the singular noun describing an element of LIST; OBJECTS is the</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      plural noun describing several elements of LIST, and ACTION is a</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      transitive verb describing action by ACTOR on one or more elements</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      of LIST.  If HELP is omitted or nil, it defaults</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      to </span><span style="color: #EBBF83; background-color: var(--bg-doc);">\</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">(\"object\" \"objects\" \"act on\").</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      If ACTION-ALIST is given, it is an alist specifying additional keys</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      that will be accepted as an answer to the questions.  Each element</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      of the alist has the form (KEY FUNCTION HELP), where KEY is a character;</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      FUNCTION is a function of one argument (an object from LIST); and HELP</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      is a string.  When the user presses KEY, FUNCTION is called; if it</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      returns non-nil, the object is considered to have been \"acted upon\",</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      and `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">map-y-or-n-p</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">' proceeds to the next object from LIST.  If</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      FUNCTION returns nil, the prompt is re-issued for the same object: this</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      comes in handy if FUNCTION produces some display that will allow the</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      user to make an intelligent decision whether the object in question</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      should be acted upon.  If the user types \\[</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">help-command</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">], the string</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      given by HELP is used to describe the effect of KEY.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      Optional argument NO-CURSOR-IN-ECHO-AREA, if non-nil, means not to set</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">cursor-in-echo-area</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">' while prompting with the questions.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      This function uses `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">query-replace-map</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">' to define the standard responses,</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      but only some of the responses which `</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">query-replace</span><span style="color: var(--clr-doc); background-color: var(--bg-doc);">' understands</span>
<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      are meaningful here, as described above.</span>

<span style="color: var(--clr-doc); background-color: var(--bg-doc);">      The function's value is the number of actions taken."</span>
  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let*</span> ((actions 0)
         (msg (current-message))
         user-keys mouse-event map prompt char elt def
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Non-nil means we should use mouse menus to ask.</span>
         use-menus
         delayed-switch-frame
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Rebind other-window-scroll-buffer so that subfunctions can set</span>
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">it temporarily, without risking affecting the caller.</span>
         (other-window-scroll-buffer other-window-scroll-buffer)
         (next (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (functionp list)
                   (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> () (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> elt (funcall list)))
                 (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> () (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">when</span> list
                              (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> elt (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">pop</span> list))
                              t))))
         (try-again (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> ()
                      (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((x next))
                        (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> next (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> () (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> next x) elt))))))
    (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> (listp last-nonmenu-event)
             use-dialog-box)
        <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Make a list describing a dialog box.</span>
        (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((objects (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> help (capitalize (nth 1 help))))
              (action (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> help (capitalize (nth 2 help)))))
          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> map `((<span style="color: var(--clr-string); background-color: var(--bg-string);">"Yes"</span> . act) (<span style="color: var(--clr-string); background-color: var(--bg-string);">"No"</span> . skip)
                      ,@(mapcar (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> (elt)
                                  (cons (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">with-syntax-table</span>
                                            text-mode-syntax-table
                                          (capitalize (nth 2 elt)))
                                        (vector (nth 1 elt))))
                                action-alist)
                      (,(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> help (concat action <span style="color: var(--clr-string); background-color: var(--bg-string);">" This But No More"</span>)
                          <span style="color: var(--clr-string); background-color: var(--bg-string);">"Do This But No More"</span>) <span style="color: #EBBF83;">. act-and-exit)</span>
                      (,(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> help (concat action <span style="color: var(--clr-string); background-color: var(--bg-string);">" All "</span> objects)
                          <span style="color: var(--clr-string); background-color: var(--bg-string);">"Do All"</span>) <span style="color: #EBBF83;">. automatic)</span>
                      (<span style="color: var(--clr-string); background-color: var(--bg-string);">"No For All"</span> . exit))
                use-menus t
                mouse-event last-nonmenu-event))
      (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> user-keys (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> action-alist
                          (concat (mapconcat (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> (elt)
                                               (key-description
                                                (vector (car elt))))
                                             action-alist <span style="color: var(--clr-string); background-color: var(--bg-string);">", "</span>)
                                  <span style="color: var(--clr-string); background-color: var(--bg-string);">" "</span>)
                        <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span>)
            <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Make a map that defines each user key as a vector containing</span>
            <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">its definition.</span>
            map
            (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((map (make-sparse-keymap)))
              (set-keymap-parent map query-replace-map)
              (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">dolist</span> (elt action-alist)
                (define-key map (vector (car elt)) (vector (nth 1 elt))))
              map)))
    (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">unwind-protect</span>
        (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">progn</span>
          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (stringp prompter)
              (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> prompter (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((prompter prompter))
                               (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> (object)
                                 (format prompter object)))))
          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">while</span> (funcall next)
            (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> prompt (funcall prompter elt))
            (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span> ((stringp prompt)
                   <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Prompt the user about this object.</span>
                   (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> quit-flag nil)
                   (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> use-menus
                       (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> def (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> (x-popup-dialog (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> mouse-event use-menus)
                                                     (cons prompt map))
                                     'quit))
                     <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Prompt in the echo area.</span>
                     (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((cursor-in-echo-area (not no-cursor-in-echo-area)))
                       (message (apply 'propertize <span style="color: var(--clr-string); background-color: var(--bg-string);">"%s(y, n, !, ., q, %sor %s) "</span>
                                       minibuffer-prompt-properties)
                                prompt user-keys
                                (key-description (vector help-char)))
                       (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> minibuffer-auto-raise
                           (raise-frame (window-frame (minibuffer-window))))
                       (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">while</span> (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">progn</span>
                                (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> char (read-event))
                                <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">If we get -1, from end of keyboard</span>
                                <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">macro, try again.</span>
                                (equal char -1)))
                       <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Show the answer to the question.</span>
                       (message <span style="color: var(--clr-string); background-color: var(--bg-string);">"%s(y, n, !, ., q, %sor %s) %s"</span>
                                prompt user-keys
                                (key-description (vector help-char))
                                (single-key-description char)))
                     (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> def (lookup-key map (vector char))))
                   (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">cond</span> ((eq def 'exit)
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> next (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> () nil)))
                         ((eq def 'act)
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Act on the object.</span>
                          (funcall actor elt)
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> actions (1+ actions)))
                         ((eq def 'skip))
                         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Skip the object.</span>

                         ((eq def 'act-and-exit)
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Act on the object and then exit.</span>
                          (funcall actor elt)
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> actions (1+ actions)
                                next (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> () nil)))
                         ((eq def 'quit)
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> quit-flag t)
                          (funcall try-again))
                         ((eq def 'automatic)
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Act on this and all following objects.</span>
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (funcall prompter elt)
                              (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">progn</span>
                                (funcall actor elt)
                                (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> actions (1+ actions))))
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">while</span> (funcall next)
                            (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (funcall prompter elt)
                                (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">progn</span>
                                  (funcall actor elt)
                                  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> actions (1+ actions))))))
                         ((eq def 'help)
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">with-help-window</span> (help-buffer)
                            (princ
                             (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((object  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> (nth 0 help) <span style="color: var(--clr-string); background-color: var(--bg-string);">"object"</span>))
                                   (objects (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> (nth 1 help) <span style="color: var(--clr-string); background-color: var(--bg-string);">"objects"</span>))
                                   (action  (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">or</span> (nth 2 help) <span style="color: var(--clr-string); background-color: var(--bg-string);">"act on"</span>)))
                               (concat
                                (format-message
                                 (substitute-command-keys <span style="color: var(--clr-string); background-color: var(--bg-string);">"\</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">      Type \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">SPC</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' or \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">y</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' to %s the current %s;</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">      \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">DEL</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' or \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">n</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' to skip the current %s;</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">      \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">RET</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' or \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">q</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' to skip the current and all remaining %s;</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">      \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">C-g</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' to quit (cancel the whole command);</span>
<span style="color: var(--clr-string); background-color: var(--bg-string);">      \\`</span><span style="color: var(--clr-constant); background-color: var(--bg-constant);">!</span><span style="color: var(--clr-string); background-color: var(--bg-string);">' to %s all remaining %s;\n"</span>)
                                 action object object objects action objects)
                                (mapconcat (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">lambda</span> (elt)
                                             (format <span style="color: var(--clr-string); background-color: var(--bg-string);">"%s to %s;\n"</span>
                                                     (single-key-description
                                                      (nth 0 elt))
                                                     (nth 2 elt)))
                                           action-alist
                                           <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span>)
                                (format
                                 <span style="color: var(--clr-string); background-color: var(--bg-string);">"or . (period) to %s the current %s and exit."</span>
                                 action object)))))

                          (funcall try-again))
                         ((<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> (symbolp def) (commandp def))
                          (call-interactively def)
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Regurgitated; try again.</span>
                          (funcall try-again))
                         ((vectorp def)
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">A user-defined key.</span>
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> (funcall (aref def 0) elt) <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;</span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Call its function.</span>
                              <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">The function has eaten this object.</span>
                              (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> actions (1+ actions))
                            <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Regurgitated; try again.</span>
                            (funcall try-again)))
                         ((<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">and</span> (consp char)
                               (eq (car char) 'switch-frame))
                          <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">switch-frame event.  Put it off until we're done.</span>
                          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> delayed-switch-frame char)
                          (funcall try-again))))
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(t</span>
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Random char.</span>
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(message "Type %s for help."</span>
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;;      </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(key-description (vector help-char)))</span>
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(beep)</span>
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(sit-for 1)</span>
                  <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">(funcall try-again))))</span>
                  (prompt
                   (funcall actor elt)
                   (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> actions (1+ actions))))))
      (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> delayed-switch-frame
          (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> unread-command-events
                (cons delayed-switch-frame unread-command-events))))
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Clear the last prompt from the minibuffer, and restore the</span>
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">previous echo-area message, if any.</span>
    (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">let</span> ((message-log-max nil))
      (<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">if</span> msg
          (message <span style="color: var(--clr-string); background-color: var(--bg-string);">"%s"</span> msg)
        (message <span style="color: var(--clr-string); background-color: var(--bg-string);">""</span>)))
    <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">Return the number of actions that were taken.</span>
    actions))
</pre>
</div>
</div>
</div>
</div>
